/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   excute.c                                           :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: minjupar <minjupar@student.42seoul.kr>     +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2022/04/25 17:07:58 by minjupar          #+#    #+#             */
/*   Updated: 2022/04/25 17:09:51 by minjupar         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "minishell.h"

void	excute_cmd(t_cmd *head)
{
	if (!head->next && head->cmd)
	{
		//빌트인 실행
	}
	else
	{
		//파이프 여러개 일때
	}
}
