/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   excute.c                                           :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: jinyoo <jinyoo@student.42seoul.kr>         +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2022/04/25 17:07:58 by minjupar          #+#    #+#             */
/*   Updated: 2022/04/25 22:40:13 by jinyoo           ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "minishell.h"

void	execute_cmd(t_cmd *command)
{
	if (!command->next && command->cmd)
	{
		//빌트인 실행
		if (command->)
	}
	else
	{
		//파이프 여러개 일때
	}
}
